TargetApplication=DKLang Translation Editor
Author=Naohiko TAKASAKI
SourceLANGID=1033
LANGID=1041
Generator=DKLang Translation Editor v3.0
LastModified=2009-06-11 01:48:39

[dAbout]
00000001=DKLang Translation Editorについて
00000004=Internet:
00000005=OK
00000006=Contact e-mail:

[dDiffLog]
00000001=違いが見つかりました
00000002=閉じる(&C)
00000003=合計
00000004=翻訳リポジトリを使って未翻訳のエントリーを全て自動翻訳する(&A)
00000005=ヘルプ(&H)

[dFind]
00000001=検索 または 置換
00000003=閉じる(&C)
00000004=検索対象(&S):
00000006=オプション
00000007=大文字小文字の判別(&C)
00000008=単語のみ(&W)
00000010=選択された部分のみ対象(&D)
00000011=オリジナル
00000012=カーソルのあるところから(&M)\n全体(&E)\n
00000013=方向
00000014=前へ(&F)\n後へ(&B)\n
00000015=置換時に確認(&P)
00000016=全て置換(&A)
00000017=置換(&R):
00000018=範囲
00000019=エントリーを検索(&N)
00000020=翻訳前の値を検索(&O)
00000021=翻訳後の値を検索(&T)
00000022=ヘルプ(&H)

[dOpenFiles]
00000001=言語ファイルを開く
00000002=言語ファイル(&L):
00000003=表示(&B)...
00000004=表示(&W)...
00000005=表示(&S)...
00000006=(ソースファイルの代わりに)以下の翻訳ファイルを表示用に使う(&U)
00000007=新しい翻訳を作成する(&C)
00000008=既存の翻訳ファイルを開く(&O):
00000009=OK
00000010=キャンセル
00000011=ヘルプ

[dPromptReplace]
00000001=置換の確認
00000009=はい(&Y)
00000010=キャンセル
00000012=全て置換(&A)
00000013=いいえ(&N)
00000014=ヘルプ

[dSettings]
00000001=プログラムの設定(&P)
00000002=OK
00000003=キャンセル
00000005=翻訳リポジトリの場所(&N):
00000006=(ショートカットを手動で設定しないといけない場合)
00000007=表示(&B)...
00000008=リポジトリに文字列を追加する際にプレフィックス文字('&&')を削除する(&R)
00000009=リポジトリに新しい翻訳を自動で追加する(&A)
00000013=表示フォント(&I)...
00000014=テーブルフォント(&T)...
00000015=言語ソースと保存された翻訳が異なるエンコードでも警告しない(&W)
00000016=リポジトリ
00000017=インターフェース
00000018=ヘルプ

[dTranProps]
00000001=翻訳プロパティ
00000002=元の言語(翻訳リポジトリに使用)(&S):
00000003=翻訳後の言語(&T):
00000004=作成者(&A):
00000005=追加パラメータ ('Name=Value'形式で記述)(&D):
00000006=対象プログラム/バージョン(&T):
00000007=OK
00000008=キャンセル
00000009=ヘルプ

[fMain]
00000002=メインメニュー
00000003=ファイル(&F)
00000004=編集(&E)
00000005=表示(&V)
00000006=ツールバー(&T)
00000007=ツールバーの表示/非表示
00000008=現在のソースエントリー(&U)
00000009=現在のソースエントリーの表示/非表示
00000010=ステータスバー(&S)
00000011=ステータスバーの表示/非表示
00000012=言語(&L)
00000013=ツール(&T)
00000014=ヘルプ(&H)
00000015=ツールバー
00000018=エントリーの合計数
00000020=コンポーネントプロパティの合計/未翻訳数
00000022=固定値の合計/未翻訳数
00000024=リポジトリのエントリー数
00000025=ファイル
00000026=新規または開く(&N)...
00000027=新規または開く...|新しい翻訳を作成または既存の翻訳を開く
00000028=ファイル
00000029=保存(&S)
00000030=保存|現在の翻訳を保存
00000031=ファイル
00000032=別名で保存(&A)...
00000033=別名で保存...|現在の翻訳を別のファイルで保存
00000034=ファイル
00000035=閉じる(&C)
00000036=閉じる|現在開いているファイルを閉じる
00000037=ファイル
00000038=終了(&E)
00000039=終了|プログラムを終了する
00000040=ツール
00000041=プログラムの設定(&P)...
00000042=プログラムの設定...|プログラムの設定を表示または変更します。
00000043=ヘルプ
00000044=このプログラムについて(&A)...
00000045=このプログラムについて...|バージョンと著作権情報
00000046=編集
00000047=前の未翻訳のエントリにジャンプ(&V)
00000048=前の未翻訳または自動翻訳済のエントリにジャンプ
00000049=編集
00000050=次の未翻訳のエントリにジャンプ(&S)
00000051=次の未翻訳または自動翻訳済のエントリにジャンプ
00000058=編集
00000059=翻訳プロパティ(&T)...
00000060=翻訳プロパティ...|翻訳プロパティの表示または変更します。
00000064=ツール
00000065=自動翻訳選択済(&U)
00000066=自動翻訳選択済|翻訳リポジトリを使用した自動翻訳が現在選択されています
00000067=ツール
00000068=選択範囲をリポジトリに追加(&R)
00000069=選択範囲をリポジトリに追加|選択範囲を翻訳リポジトリに追加します
00000073=ヘルプ
00000074=更新を確認(&U)
00000075=更新を確認|Web上でプログラムの更新を確認します
00000076=ヘルプ
00000077=DKLang Translation Editor ホームページ(&M)
00000078=DKLang Translation Editor ホームページ|ブラウザでこのプログラムのホームページを開きます。
00000079=ヘルプ
00000080=製品サポート
00000081=製品サポート|ブラウザで製品とサポートページを開きます
00000082=ヘルプ
00000083=DK Software &Webサイト
00000084=DK Software &Webサイト|ブラウザでベンダーのホームページを開きます
00000087=インターネット(&I)
00000088=編集
00000089=フォーカスの切替(&G)
00000090=フォーカスの切替|フォーカスを一覧と編集画面との間で切り替えます
00000091=編集
00000092=前のエントリ(&Y)
00000093=前のエントリ|1つ前のエントリに移動します
00000094=編集
00000095=後のエントリ(&N)
00000096=後のエントリ|1つ後のエントリに移動します
00000097=エントリプロパティ(E)
00000098=現在のソースエントリー
00000099=現在の翻訳済エントリ
00000100=未翻訳(&U)
00000101=エントリ状態
00000102=自動翻訳済(&A)
00000103=エントリプロパティ(&E)
00000104=現在翻訳済エントリ(&R)
00000105=コンポーネント/プロパティ/固定値
00000106=ID
00000107=既定値
00000108=翻訳値
00000109=編集
00000110=検索(&F)...
00000111=検索...|指定された条件でエントリを検索します
00000112=編集
00000113=次を検索(&X)
00000114=次を検索|以前文字列検索で表示されたのと同じ次の同じ文字列を検索します
00000115=編集
00000116=置換(&R)...
00000117=置換...|文字列を他の文字列に置き換えます
00000118=ブックマーク
00000119=現在の翻訳エントリパネルを表示/非表示
00000120=エントリプロパティパネルを表示/非表示
00000121=ブックマーク(&B)
00000122=ブックマークパネルの表示/非表示
00000123=編集
00000124=ブックマークの追加(&A)
00000125=ブックマークの追加|現在のエントリをブックマークリストに追加します
00000126=編集
00000127=ブックマークの削除(&D)
00000128=ブックマークの削除|現在選択しているブックマークを外します。
00000129=編集
00000130=ブックマークにジャンプ(&J)
00000131=ブックマークにジャンプ|ブックマークウィンドウ内で現在選択しているブックマークにジャンプ
00000132=ブックマークツールバー
00000133=編集
00000134=コピー(&C)
00000135=編集
00000136=貼り付け(&P)
00000137=編集
00000138=切り取り(&U)
00000139=コピー|選択した文字列をクリップボードへコピーします
00000140=貼り付け|クリップボードから文字列を貼り付けます
00000141=切り取り|選択した文字列をクリップボードへ切り取ります
00000142=ヘルプ
00000143=ヘルプ(&H)
00000144=ヘルプ|プログラムヘルプを表示します

[$CONSTANTS]
SBtn_Find=検索(&S)
SBtn_Replace=置換(&R)
SConfirm_FileNotSaved=翻訳ファイル "%s" は変更されていますが保存されていません。保存しますか？
SDiffDesc_AddComponent=+ コンポーネント: [%s]
SDiffDesc_AddConstant=+ 固定値 "%s"
SDiffDesc_AddProperty=+ プロパティ "%s" (ID=%d)
SDiffDesc_ExcessiveEntries=以下のエントリーは過度であることがわかって、翻訳から削除されました:
SDiffDesc_MissingEntries=以下のエントリーは見つからなかったので、翻訳に追加されました:
SDiffDesc_RemoveComponent=- コンポーネント: [%s]
SDiffDesc_RemoveConstant=- 固定値 "%s"
SDiffDesc_RemoveProperty=- コンポーネント "%s", プロパティ ID=%d
SDiffTotalsText=\tコンポーネント\tプロパティ\t固定値\n追加\t%d\t%d\t%d\n削除\t%d\t%d\t%d\n合計\t%d\t%d\t%d
SDlgTitle_Confirm=確認
SDlgTitle_Error=エラー
SDlgTitle_Info=情報
SDlgTitle_SaveTranFileAs=保存する翻訳ファイルを選択してください
SDlgTitle_SelectDisplayFile=表示する翻訳ファイルを選択してください
SDlgTitle_SelectLangSourceFile=言語ソースファイルを選択してください
SDlgTitle_SelectTranFile=翻訳ファイルを選択してください
SDlgTitle_SelReposPath=翻訳リポジトリの場所を選択してください:
SErrMsg_CharMissing="%s" が見つかりません
SErrMsg_ConstNameMissing=固定値が見つかりません
SErrMsg_DuplicateCompName=重複したコンポーネント名: "%s"
SErrMsg_DuplicatePropID=重複プロパティID: %d
SErrMsg_DuplicatePropName=重複プロパティ名: "%s"
SErrMsg_FileDoesntExist=ファイル "%s" が見つかりません
SErrMsg_InvalidCompName=無効なコンポーネント名: "%s"
SErrMsg_LoadLangSourceFailed=言語ソースを読み込み中にエラー:\n%d行目: %s
SErrMsg_PropIDInvalid=無効なプロパティID
SErrMsg_PropIDMissing=プロパティIDが見つかりません
SErrMsg_PropNameMissing=プロパティ名が見つかりません
SErrMsg_SectionlessEntry=セクションのないエントリーは許可されません
SErrMsg_SectionNameMissing=セクション名が見つかりません
SErrMsg_SrcAndTranLangsAreSame=ソースと翻訳言語は違わなければなりません
SErrMsg_WrongSectionName=誤ったセクション名形式: "%s"
SLangSourceFileFilter=DKLang 言語 ソースファイル (*.dklang)|*.dklang|全てのファイル (*.*)|*.*
SMsg_NoSearchResults=文字列 "%s" が見つかりませんでした。
SMsg_PromptReplace="%s"の繰返しを置換しますか?
SMsg_ReplacedInfo=%d 個の"%s"を置換しました。
SNode_Constants=固定値
SStatusBar_CompCount=ｺﾝﾎﾟ: %d
SStatusBar_ConstCount=固定: %d/%d
SStatusBar_PropCount=ﾌﾟﾛﾊﾟ: %d/%d
SStatusBar_ReposEntryCount=リポジトリ: %d エントリ
STranFileFilter=DKLang 翻訳 files (*.lng)|*.lng|全てのファイル (*.*)|*.*
STranFileFilterAnsi=DKLang Ansi 翻訳 files (*.lng)|*.lng
STranFileFilterUnicode=DKLang Unicode 翻訳 files (*.lng)|*.lng
SWarnMsg_SavingInAnsi=Unicode形式のソースファイルが使用した言語の翻訳をANSI形式で保存しようとしています。ANSI形式で保存することで、翻訳しているプログラムは誤った表示を引き起こす可能性があります。Unicode形式で使用されているプログラムの場合、翻訳もUnicodeで保存する方が望ましいです。\n\nUnicode形式で翻訳を保存しますか?
SWarnMsg_SavingInUnicode=ANSI形式のソースファイルが使用した言語の翻訳をUnicode形式で保存しようとしています。Unicode形式のファイルを、対象プログラムは使用できないかもしれません。 そのプログラムがANSIを使用している場合、翻訳もANSIで保存することが最も安全です。\n\nANSI形式で翻訳を保存しますか?
